package algorithm.array;

/************************************************************************************
 * 功能描述：输入n个整数，输出其中最小的K个
 * 创建人：岳增存  yuezc@seentao.com
 * 创建时间： 2017年08月15日 --  下午6:55 
 * 其他说明：
 * 修改时间：
 * 修改人：
 *************************************************************************************/
public class SmallestK {



    /**
     *  思路1
     *
     *  对这n个数排序（从小到大），然后取前K个即可
     *
     *
     *
     */

    /*
    * 思路2
    *
    * ①将n个整数的前K个数存入到一个数组中，求出这个数组的最大值max；
    * ②对n的整数的后面的数进行遍历，每取出一个数，就与max对比，如果该数大于max，则将该树放入数组中替换掉max
    *
    *
    * */

    /**
     *
     * 思路3
     * 创建容量为K的大顶堆，堆中元素是有序的。
     *
     *
     */


}
